In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
import warnings
warnings.filterwarnings('ignore')

dataset=pd.read_csv("user_id_map.csv")

In [4]:
dataset.head()

   user_id_csv                           user_id
0            0  8842281e1d1347389f2ab93d60773d4d
1            1  72fb0d0087d28c832f15776b0d936598
2            2  ab2923b738ea3082f5f3efcbbfacb218
3            3  d986f354a045ffb91234e4af4d1b12fd
4            4  7504b2aee1ecb5b2872d3da381c6c91e

In [6]:
dataset=pd.read_csv("goodreads_interactions.csv")

In [7]:
dataset.head()

   user_id  book_id  is_read  rating  is_reviewed
0        0      948        1       5            0
1        0      947        1       5            1
2        0      946        1       5            0
3        0      945        1       5            0
4        0      944        1       5            0

In [8]:
dataset.shape

(228648342, 5)

In [11]:
dataset1= dataset.loc[dataset.is_reviewed!=0]

In [12]:
dataset1.shape

(16219149, 5)

In [13]:
dataset1.dtypes

user_id        int64
book_id        int64
is_read        int64
rating         int64
is_reviewed    int64
dtype: object

In [14]:
dataset2=pd.read_csv("book_id_map.csv")

In [15]:
dataset2.head()

   book_id_csv   book_id
0            0  34684622
1            1  34536488
2            2  34017076
3            3     71730
4            4  30422361